/**
 * Основной пакет проекта <b>Frogito</b>.
 * <p>
 * Содержит компоненты компилятора и интерпретатора языка Frogito.
 * </p>
 * <p>
 * Структура пакетов:
 * <ul>
 *   <li>{@code lang.lexer} — лексический анализатор, выполняющий разбиение исходного кода на токены;</li>
 *   <li> Остальное в разработке</li>
 * </ul>
 *
 * <p>
 * Проект реализован вручную, без использования внешних генераторов (ANTLR, JFlex, LLVM),
 * в учебных целях для демонстрации принципов построения компилятора.
 * </p>
 *
 * @author Frogito Compiler Team
 * @version 1.0
 * @since 1.0
 */
package lang;